---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.DoubleWallMaterial
source: html/c25b92b2-93d0-2aca-b7b2-1b0bdf193e2e.htm
---
# Autodesk.Revit.DB.FabricationPart.DoubleWallMaterial Property

The double wall material identifier of the fabrication part.

## Syntax (C#)
```csharp
public int DoubleWallMaterial { get; }
```